{
  "A La Carte": "Menu in which items and beverages are priced individually",
  "A la grecque": "A preparation style where vegetables are marinated in olive oil, lemon juice and herbs and served cold.",
  "A Point": "French term for cooking until the ideal degree of doneness. When referred to meat, it means medium rare.",
  "Acid": "A substance that neutralizes a base (alkaline) in a liquid solution. Foods like citrus juice, vinegar and wine that have a sour or sharp flavor. Acids have a PH of less than 7.",
  "Acidulation": "The process of adding citric or acetic acid to water, used to preserve color, to clean aluminum or to soak kidneys and game.",
  "Additives": "Substances added to many foods to prevent spoilage or to improve appearance, texture, flavor or nutrition. They might be synthetic materials copied from nature or naturally occurring substances.",
  "Aerate": "To incorporate air into a mixture by sifting or mixing.",
  "Aerobic Bacteria": "Those bacteria which thrive on oxygen.",
  "Aging": "The period where freshly killed meat is allowed to rest so that the effects of rigor mortis dissipate, or the period during with freshly milled flour is allowed to rest so it whitens and produces less sticky dough.",
  "Airline Breast": "Boneless chicken breast with the first wing bone still attached.",
  "Al Dente": "Italian term meaning 'to the tooth'. Used to describe mainly pasta that is cooked until a slight resistance when bitten into.",
  "Albumen": "Primary protein found in egg whites.",
  "Alkali": "Also known as a base, any substance with a pH higher than a 7.",
  "Alkaloid": "A number of bitter organic substances with alkaline properties found often in plants and sometimes in drugs.",
  "Allemande": "Sauce made by adding lemon juice and liason to veloute made from veal stock.",
  "Allumette": "A matchstick cut 3 mm x 3mm x 5 to 6 cm  (1/8 in x 1/8 in x 2 to 2-1/2 in) long and usually for potatoes.",
  "American Service": "Restaurant service in which the waiter takes the orders and brings the food to the table.",
  "Amino Acid": "The base molecular component of proteins.",
  "Anaerobic Bacteria": "Those bacteria which are able to live and grow without the presence of oxygen.",
  "Angus Beef": "A brand created in 1978 to distinguish the highest-quality beef produced from descendants of the black hornless Angus cattle of Scotland",
  "Anterior": "At or toward the front of an object.",
  "Appetizers": "Also known as first courses, small portioned hot or cold foods.",
  "Aroma": "The sensations as interpreted by the brain.",
  "Aspic": "A clear jelly usually made from a clarified butter stock thickened with gelatine, used to coat foods with a strong reflective glaze.",
  "Aspic Jelly": "A clear jelly usually made from a clarified butter stock thickened with gelatine, used to coat foods with a strong reflective glaze.",
  "Au gratin": "Food cooked with a browned or crusted top, often made with bread crumbs, cheese and/or sauce topping and cooked under a salamander/broiler.",
  "Au Jus": "Roasted meat, poultry or game served with their natural unthickened juices.",
  "Au Sec": "Cooked until nearly dry",
  "Bain Marie": "Hot water bath used to gently cook food or keep food hot. Container for holding food in a hot water bath.",
  "Baked Alaska": "Ice cream set on a layer of spongecake and encased in meringue then baked until the meringue is warm and golden.",
  "Baking Powder": "A mixture of sodium bicaronate and one or more acids, generally cream of tartar or sodium aluminum sulphate, used to leaven baked goods. It releases carbon dioxide gases if moisture is present. Single-acting baking powder released CO2 in the presence of moisture only. Double-acting baking powder releases CO2 upon contact with moisture and more gas is released when heat is applied.",
  "Baking": "Dry-heat cooking method in which foods are surrounded by hot, dry air in a closed environment similar to roasting.",
  "Ballontine": "Boneless poultry leg stuffed with forcemeat and gently roasted/braised, traditionally shaped into a ball.",
  "Barding": "Tying thin slices of fat such as pork or bacon, over meats or poultry that have little fat to help keep moist.",
  "Base": "A subsrance the neutralizes an acid in a liquid solution.",
  "Basic Sauces": "Also known as leading or mother sauces, the foundation for the entire classic repertoire  of hot sauces. The five leading sauces (Bechamel, veloute, espagnole, tomato and hollandaise)",
  "Baste": "To moisten foods using their natural juices periodically during cooking.",
  "Bechamel": "A basic sauce made by thickening milk with white roux and adding seasonings.",
  "Beer": "An alcoholic beverage made from water, hops and malted barley.",
  "Beurre blanc": "French for white butter, an emulsified butter sauce made from shallots white wine and butter.",
  "Beurre manie":  "A combination of equal amounts by weight of flour and soft whole butter. Whisked into a simmering sauce at the end of the cooking process for quick thickening and added sheen and flavor",
  "Beurre noir": "French for black butter, whole butter cooked until dark brown (Not black) sometimes flavored with vinegar or lemon juice.",
  "Beurre rouge": "French for red butter, an emulsified butter sauce made from shallots, red wine and butter",
  "Bisque": "A puree soup made from crustacean shells, classic versions are thickened with rice.",
  "Bloom": "A white powdery layer that sometimes appears on chocolate if the cocoa butter separates.",
  "Bombe": "Two or more flavors of ice cream or ice cream and sherbet, shaped in a spherical mould, each flavor a separate layer that forms the shell for the next flavor.",
  "Bordelaise": "A brown sauce flavored with a reduction of red wine, shallots, pepper and herbs garnihsed with bone marrow.",
  "Bound Salad": "A salad comprising of cooked meats, poultry, fish, shellfish, pasta or potatoes combined with a dressing.",
  "Blanching": "To briefly submerge in simmering water, boiling water, or fat to assist in preparation of foods. Example: Tomato concassee.",
  "Bouquet Garni": "Fresh herbs and vegetables tied into a cheesecloth bundle and used to flavor sauces, soups, stocks, stews.",
  "Brine": "A mixture of salt, water and seasoning used to preserve foods.",
  "Brochette": "Skewered hors d’oeuvres using meats, fish, shellfish, vegetables and grilled or broiled.",
  "Canape": "A tiny open-faced sandwich served as an hors d’ouevre.",
  "Capon": "Class of surgically castrated male chickens.",
  "Capsaicin": "Alkaloid found in chile pepper’s placental ribs that provides the pepper’s heat.",
  "Carotenoid": "A naturally occurring pigment that predominates in red and yellow vegetables such as carrots and red peppers.",
  "Cellulose": "A complex carbohydrate  found in the cell wall of plants. It is edible but indigestible by humans.",
  "Chiffonade": "A preparation of finely sliced or shredded leafy vegetables or herbs.",
  "Coagulation": "The irreversible transformation of proteins from a liquid or semi liquid state to a drier, solid state.",
  "Coenzyme": "Any of the various small substances of which contain a B vitamin that promote or assist an enzyme’s activities.",
  "China cap/Chinois": "A conical shaped strainer.",
  "Concasse": "Peeled, seeded and diced tomato",
  "Confit": "Lightly cured meat, usually duck or goose, stewed in its own fat. Pieces are packed in the fat and chilled for later use.",
  "Coring": "The process of removing the seeds or pit from a fruit or fruit vegetable.",
  "Coulis": "A sauce made from a puree of vegetables and/or fruit.",
  "Court bouillon": "Water simmered with vegetables, seasonings and an acidic product such as vinegar or wine. Used for simmering or poaching fish, shellfish or vegetables.",
  "Couverture": "A high-quality chocolate containing at least 32 percent cocoa butter.",
  "Croquette": "A food that has been pureed or bound with a thick sauce.",
  "Deglaze": "To swirl or stir in a liquid into a hot pan to lift away caramelized food particles.",
  "Degrease": "To remove fat from the surface of a liquid such as a stock or sauce by skimming the surface.",
  "Dredging": "To coat a food item in flour or ground crumbs prior to frying or sauteing.",
  "Dress": "To trim or clean an animal for cooking",
  "Duxelles": "Coarse paste made from finely chopped mushrooms sauteed with shallots in butter",
  "Egg Wash": "A mixture of beaten eggs (whole eggs, yolks or whites) and a liquid, usually water or milk, used to coat dough before baking.",
  "Emince": "A small, thin boneless piece of meat.",
  "Emlusion": "A uniform mixture of two unmixable liquids, such as oil and water, are forced into a uniform distributions.",
  "Espagnole": "Also known as brown sauce, a basic sauce made of brown stock, mirepoix and tomatoes thickened with brown roux.",
  "Essence": "A sauce made from a concentrated vegetable juice.",
  "Evaporation": "Heated water that is turned into a gas a vaporizes.",
  "Fabricated Cuts": "Individual portions of meat cut from a subprimal.",
  "Fillet": "Removing the side of fish intact while removing all bones.",
  "Flambe": "Food flamed by use of alcohol for flavor.",
  "Flash Frozen": "Food that has been frozen very rapidly using metal plates, extremely low temperatures or chemical solutions.",
  "Flavonoids": "Plant pigments that dissolve readily in water, found in red, purple and white vegetables such as blueberries, red cabbage and beats.",
  "Foie Gras": "Liver or specially fattened geese or ducks.",
  "Fond": "French for stock or base. Drippings and bits of food left in a pan after foods are roasted.",
  "Fondant": "Sweet, thick opaque sugar paste used for glazing pastries such as napoleons or making candies.",
  "Frenching": "Trimming racks of rib or poultry so the bone is cleaned and prominent.",
  "Glace de viande": "Dark, syrupy meat glaze made by reducing beef stock.",
  "Jacquarding": "The process of poking holes into the muscle of meat in order to tenderize.",
  "Jus lie": "Can be called fond lie, sauce made by thickening brown stock using corn starch or similar starch.",
  "Larding": "Inserting thin slices of fat directly into meat product to infuse moisture.",
  "Mince": "To cut into very small pieces where uniformity or shape is not important.",
  "Mise en Place": "Meaning 'Everything in place', refers to the preparation and organization of ingredients and equipment.",
  "Nappe": "A certain consistency in liquid that coats the back of a spoon.",
  "Needling": "Injecting fat or flavors into an ingredient to enhance moisture or flavor.",
  "Onion Brule": "French for burnt onion, made by charring onion halves. Used to flavor and color stocks & sauces.",
  "Onion Pique": "Studding an onion with a bay leaf and cloves. Used in bechamel sauce.",
  "Parboiling": "To partial cook a food in simmering/boiling water. Similar to blanching, but cooked for longer.",
  "Parcooking": "Partially cooking food by any cooking method.",
  "Paupiette": "Thin slice of meat, poultry or fish spread with savory stuffing and rolled and braised or poached.",
  "Professional Cooking": "System of cooking that appreciates the proper techniques of ingredients and knowledge.",
  "Raft": "Crust formed during production of consomme.",
  "Remouillage": "The process of reusing bones for a second stock. French meaning 'rewetting'.",
  "Render": "To transform solid fat into liquid form by use of heat.",
  "Refreshing": "Submerging a hot food item in cold water to quickly stop the cooking process. Also known as an icebath.",
  "Ricer": "Sievelike tool used to force soft foods through to evenly breakup the product, such as potatoes.",
  "Rondeau": "Shallow, wide, straight-sided pot with loop handles.",
  "Roulade": "Slice of meat, poultry or fish rolled around a stuffing.",
  "Sachet": "Containing herbs and spices used to flavor stocks, soups and sauces. Easily removable.",
  "Sauteuse": "Basic sauteing pan with sloped sides and single long handle.",
  "Sautoir": "A variation of a saute pan with straight sides and long handle.",
  "Savoury": "Spied or seasoned foods, opposed to sweet.",
  "Scald": "To heat a liquid, usually milk to just below boiling.",
  "Sear": "Brown food quickly over high heat, done as a preparatory step for further methods such as braising or roasting.",
  "Silverskin": "Tough connective tissue that surrounds certain muscles.",
  "Staling": "Known as starch retrogradation, change in moisture within starch that causes products to turn firm, drier and more crumbly.",
  "Steep": "Soaking food in a hot liquid in order to extract flavor or remove impurities.",
  "Sweat": "To cook food in a pan, usually covered, without browning over low heat to encourage flavors to be extracted from vegetables and spices.",
  "Sweetbreads": "Thymus gland of calf or lamb.",
  "Tempering": "To slowly add hot liquid to eggs while stirring vigorously to slowly bring mixture up to temperature without curdling the eggs.",
  "Tourner": "To shape vegetables while peeling. Procedure is to peel, then shape.",
  "Truss": "Tying whole poultry or meat to encourage even cooking.",
  "Water Bath": "Hot water bath used to gently cook food or keep food hot. Container for holding food in a hot water bath.",
  "Whetstone": "A special dense, grained stone used to sharpen or hone knives.",
  "Zushi": "The seasoned rice used in preparing sushi."
}